# StairstypeShowStairPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeShowStairPath Property
ParameterTypeId Class See Also
---
"Show Stair Path in Plan": Show Stair Path in Plan
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeShowStairPath { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeShowStairPath As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeShowStairPath {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace